---
kind: other
id: Properties.T:Autodesk.Revit.DB.CurveLoop
source: html/2b1753c7-8c36-e70d-d1bf-df5f2f215e4c.htm
---
# CurveLoop Properties

Specifies whether the .NET object represents a valid Revit entity.